app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "New Title11"], ["room_number", 11], ["updated_at", "2020-05-19 20:54:08.606348"], ["id", 10]]
---
  def update
    current_schoolClass
    @school_class.update(school_class_params)