app/controllers/students_controller.rb

    def update
        @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Esther!!"], ["updated_at", "2020-05-19 23:01:39.213219"], ["id", 3]]